# Clear Method (Field) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Entity..::..Clear Method (Field)
Entity Class See Also
---
Resets the field to its default value.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Clear(
	Field field
)
```

Visual Basic
---
```text
Public Sub Clear ( _
	field As Field _
)
```

Visual C++
---
```text
public:
void Clear(
	Field^ field
)
```

# ### Parameters
field
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..Field The field to clear.
# Remarks
The default value is zero for numeric fields, invalid value for identifiers and entities, and empty for strings and containers.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The Field belongs to a different Schema from this Entity, or this Entity is invalid. -or- This field's subschema prevents writing. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Entity Class
Clear Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace